ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/Forms/ФормаНастройкиЯчеекВГХ/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоляСтруктурыНастроек = "ИспользоватьВГХ            	 		
							|ПриоритетДляСмешанныхЯчеек 	 		
							|ПриоритетДляМонотоварныхЯчеек 		
							|ПриоритетДляПустыхЯчеек       		
							|ПриоритетДляПрочихЯчеек       		
							|МонотоварностьПоТовару        		
							|МонотоварностьПоТоваруХарактеристике";
	ИмяЭтойФормы = Метаданные.Справочники.вмс_НастройкиПрограммы.Формы.ФормаНастройкиЯчеекВГХ.Имя;
	
	оОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.вмс_НастройкиПрограммы"));
	СтруктураНастроек = оОбъект.ХранилищеНастройки.Получить();
	
	Если НЕ СтруктураНастроек = Неопределено тогда
		ОтобразитьСохраненныеЗначенияНаФорме(СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОтобразитьСохраненныеЗначенияНаФорме(СтруктураНастроек)
	
	НастройкаВключитьВГХ = СтруктураНастроек.ИспользоватьВГХ;
	
	ПриоритетДляСмешанныхЯчеек = СтруктураНастроек.ПриоритетДляСмешанныхЯчеек;
	ПриоритетДляМонотоварныхЯчеек = СтруктураНастроек.ПриоритетДляМонотоварныхЯчеек;
	ПриоритетДляПустыхЯчеек = СтруктураНастроек.ПриоритетДляПустыхЯчеек;
	ПриоритетДляПрочихЯчеек = СтруктураНастроек.ПриоритетДляПрочихЯчеек;
	                                   
	Если СтруктураНастроек.МонотоварностьПоТоваруХарактеристике = Истина Тогда
		НастройкаМонотоварности = 2;		
	ИначеЕсли СтруктураНастроек.МонотоварностьПоТовару = Истина Тогда	
		НастройкаМонотоварности = 1;	
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СтруктураНастроек = ЗаполнитьНастройкиПоДаннымФормы();
	
	ПоместитьСтруктуруНастроекВХранилищеЗначений(СтруктураНастроек);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Функция НовыеНастройкиВГХ()
	
	СтруктураНастроек = новый Структура;	
	СтруктураНастроек.Вставить("ИспользоватьВГХ");	
	СтруктураНастроек.Вставить("ПриоритетДляСмешанныхЯчеек");
	СтруктураНастроек.Вставить("ПриоритетДляМонотоварныхЯчеек");
	СтруктураНастроек.Вставить("ПриоритетДляПустыхЯчеек");
	СтруктураНастроек.Вставить("ПриоритетДляПрочихЯчеек");
	СтруктураНастроек.Вставить("МонотоварностьПоТовару");
	СтруктураНастроек.Вставить("МонотоварностьПоТоваруХарактеристике");
	
	Возврат СтруктураНастроек;
	
КонецФункции 

&НаКлиенте
Функция ЗаполнитьНастройкиПоДаннымФормы()
	
	СтруктураНастроек = НовыеНастройкиВГХ();
	
	СтруктураНастроек.ИспользоватьВГХ 				= НастройкаВключитьВГХ;
	СтруктураНастроек.ПриоритетДляСмешанныхЯчеек 	= ПриоритетДляСмешанныхЯчеек;
	СтруктураНастроек.ПриоритетДляМонотоварныхЯчеек = ПриоритетДляМонотоварныхЯчеек;
	СтруктураНастроек.ПриоритетДляПустыхЯчеек		= ПриоритетДляПустыхЯчеек; 
	СтруктураНастроек.ПриоритетДляПрочихЯчеек 		= ПриоритетДляПрочихЯчеек;
	СтруктураНастроек.МонотоварностьПоТовару		= НастройкаМонотоварности = 1; 
	СтруктураНастроек.МонотоварностьПоТоваруХарактеристике 		= НастройкаМонотоварности = 2;
	
	Возврат СтруктураНастроек;
	
КонецФункции 

&НаСервере
Процедура ПоместитьСтруктуруНастроекВХранилищеЗначений(СтруктураНастроек)
	
	оОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.вмс_НастройкиПрограммы"));
	ХранилищеЗнач = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	
	оОбъект.ХранилищеНастройки = ХранилищеЗнач;
	оОбъект.Записать();
	
КонецПроцедуры


#КонецОбласти
